# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Alternative to backtracking PCRE-style regular expression engines
brew "re2"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
cask "font-hackgen-nerd"
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
vscode "aaron-bond.better-comments"
vscode "azemoh.one-monokai"
vscode "bierner.markdown-mermaid"
vscode "bodil.file-browser"
vscode "catppuccin.catppuccin-vsc"
vscode "christian-kohler.path-intellisense"
vscode "enkia.tokyo-night"
vscode "fabiospampinato.vscode-monokai-night"
vscode "github.github-vscode-theme"
vscode "jacobdufault.fuzzy-search"
vscode "kahole.magit"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "rokoroku.vscode-theme-darcula"
vscode "sainnhe.everforest"
vscode "vscodevim.vim"
vscode "vspacecode.vspacecode"
vscode "vspacecode.whichkey"
vscode "yzhang.markdown-all-in-one"

# おすすめ
brew "bat"       # cat の代替（シンタックスハイライト付き）
brew "fd"        # find の代替（爆速）
brew "ripgrep"   # grep の代替（爆速）
brew "fzf"       # インクリメンタル検索ツール